## Production: api
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 11 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                              NAME                               |
|--------|-----------------------------------------------------------------|
| add    | `aws_lambda_function_url.api`                                   |
|        | `aws_ssm_parameter.gcds_api_config`                             |
|        | `module.api.aws_cloudwatch_log_group.this`                      |
|        | `module.api.aws_cloudwatch_query_definition.lambda_statistics`  |
|        | `module.api.aws_iam_policy.non_vpc_policies[0]`                 |
|        | `module.api.aws_iam_policy.policies[0]`                         |
|        | `module.api.aws_iam_role.this`                                  |
|        | `module.api.aws_iam_role_policy_attachment.attachments[0]`      |
|        | `module.api.aws_iam_role_policy_attachment.lambda_insights[0]`  |
|        | `module.api.aws_iam_role_policy_attachment.non_vpc_policies[0]` |
|        | `module.api.aws_lambda_function.this`                           |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.api_policies will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "api_policies" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "ssm:GetParameters",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
    }

  # aws_lambda_function_url.api will be created
  + resource "aws_lambda_function_url" "api" {
      + authorization_type = "NONE"
      + function_arn       = (known after apply)
      + function_name      = "gc-design-system-api"
      + function_url       = (known after apply)
      + id                 = (known after apply)
      + invoke_mode        = "BUFFERED"
      + url_id             = (known after apply)
    }

  # aws_ssm_parameter.gcds_api_config will be created
  + resource "aws_ssm_parameter" "gcds_api_config" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "gc-design-system-config"
      + tags           = {
          + "CostCentre" = "gc-design-system-production"
          + "Terraform"  = "true"
        }
      + tags_all       = {
          + "CostCentre" = "gc-design-system-production"
          + "Terraform"  = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.api.aws_cloudwatch_log_group.this will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/gc-design-system-api"
      + name_prefix       = (known after apply)
      + retention_in_days = 14
      + skip_destroy      = false
      + tags              = {
          + "CostCentre" = "gc-design-system-production"
          + "Terraform"  = "true"
        }
      + tags_all          = {
          + "CostCentre" = "gc-design-system-production"
          + "Terraform"  = "true"
        }
    }

  # module.api.aws_cloudwatch_query_definition.lambda_statistics will be created
  + resource "aws_cloudwatch_query_definition" "lambda_statistics" {
      + id                  = (known after apply)
      + log_group_names     = [
          + "aws_cloudwatch_log_group.this",
        ]
      + name                = "Lambda Statistics - gc-design-system-api"
      + query_definition_id = (known after apply)
      + query_string        = <<-EOT
            filter @type = “REPORT”
            | stats
            count(@type) as countInvocations,
            count(@initDuration) as countColdStarts, (count(@initDuration)/count(@type))*100 as percentageColdStarts,
            max(@initDuration) as maxColdStartTime,
            avg(@duration) as averageDuration,
            max(@duration) as maxDuration,
            min(@duration) as minDuration,
            avg(@maxMemoryUsed) as averageMemoryUsed,
            max(@memorySize) as memoryAllocated, (avg(@maxMemoryUsed)/max(@memorySize))*100 as percentageMemoryUsed
            by bin(1h) as timeFrame
        EOT
    }

  # module.api.aws_iam_policy.non_vpc_policies[0] will be created
  + resource "aws_iam_policy" "non_vpc_policies" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = "gc-design-system-api_non_vpc"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:PutLogEvents",
                          + "logs:CreateLogStream",
                          + "logs:CreateLogGroup",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "CloudWatchAccess"
                    },
                  + {
                      + Action   = [
                          + "ecr:GetDownloadUrlForlayer",
                          + "ecr:BatchGetImage",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:ecr:ca-central-1:307395567143:repository/gc-design-system/api"
                      + Sid      = "ECRImageAccess"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags        = {
          + "CostCentre" = "gc-design-system-production"
          + "Terraform"  = "true"
        }
      + tags_all    = {
          + "CostCentre" = "gc-design-system-production"
          + "Terraform"  = "true"
        }
    }

  # module.api.aws_iam_policy.policies[0] will be created
  + resource "aws_iam_policy" "policies" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = "gc-design-system-api-0"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = (known after apply)
      + policy_id   = (known after apply)
      + tags        = {
          + "CostCentre" = "gc-design-system-production"
          + "Terraform"  = "true"
        }
      + tags_all    = {
          + "CostCentre" = "gc-design-system-production"
          + "Terraform"  = "true"
        }
    }

  # module.api.aws_iam_role.this will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "gc-design-system-api"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "CostCentre" = "gc-design-system-production"
          + "Terraform"  = "true"
        }
      + tags_all              = {
          + "CostCentre" = "gc-design-system-production"
          + "Terraform"  = "true"
        }
      + unique_id             = (known after apply)
    }

  # module.api.aws_iam_role_policy_attachment.attachments[0] will be created
  + resource "aws_iam_role_policy_attachment" "attachments" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "gc-design-system-api"
    }

  # module.api.aws_iam_role_policy_attachment.lambda_insights[0] will be created
  + resource "aws_iam_role_policy_attachment" "lambda_insights" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/CloudWatchLambdaInsightsExecutionRolePolicy"
      + role       = "gc-design-system-api"
    }

  # module.api.aws_iam_role_policy_attachment.non_vpc_policies[0] will be created
  + resource "aws_iam_role_policy_attachment" "non_vpc_policies" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "gc-design-system-api"
    }

  # module.api.aws_lambda_function.this will be created
  + resource "aws_lambda_function" "this" {
      + architectures                  = [
          + "x86_64",
        ]
      + arn                            = (known after apply)
      + function_name                  = "gc-design-system-api"
      + id                             = (known after apply)
      + image_uri                      = "307395567143.dkr.ecr.ca-central-1.amazonaws.com/gc-design-system/api:latest"
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 1024
      + package_type                   = "Image"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "CostCentre" = "gc-design-system-production"
          + "Terraform"  = "true"
        }
      + tags_all                       = {
          + "CostCentre" = "gc-design-system-production"
          + "Terraform"  = "true"
        }
      + timeout                        = 120
      + version                        = (known after apply)

      + ephemeral_storage {
          + size = 512
        }

      + tracing_config {
          + mode = "PassThrough"
        }

      + vpc_config {
          + ipv6_allowed_for_dual_stack = false
          + vpc_id                      = (known after apply)
        }
    }

Plan: 11 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

20 tests, 20 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
